Revit 2026 API

# ExporterIFCSpaceBoundaryLevel Property

---

Identifies the level of space boundaries being exported.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int SpaceBoundaryLevel { get; }
```
```vb
Public ReadOnly Property SpaceBoundaryLevel As Integer
	Get
```
```cpp
public:
property int SpaceBoundaryLevel {
	int get ();
}
```
```fsharp
member SpaceBoundaryLevel : int with get
```

#### Property Value

Int32

There are three valid values for this integer: 0 = export no space boundaries. This can save space if the receiving application doesn't use them. 1 = export 1st level space boundaries. This is the default. 2 = export 2nd level space boundaries. This is primarily for use in energy analysis programs, and the GSA.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace